In [4]:
# Create a panda series with implicit indexing
import pandas as pd

# Creating a pandas Series with implicit indexing
data = [10, 20, 30, 40, 50]
series = pd.Series(data)

# Display the Series
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
# Create a panda series with explicit indexing
import pandas as pd

# Creating a pandas Series with explicit indexing
data = [10, 20, 30, 40, 50]
index_labels = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index_labels)

# Display the Series
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [3]:
# To create a dataframe, add new column to the dataframe, perform head and tail operation, and fetch the second column from the table

import pandas as pd

# Create a dataframe
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 40, 22],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df = pd.DataFrame(data)

# Add a new column to the dataframe
df['Salary'] = [50000, 60000, 70000, 80000, 55000]

# Perform head and tail operations
print("Head of the dataframe:")
print(df.head())

print("\nTail of the dataframe:")
print(df.tail())

# Fetch the second column (Age)
second_column = df.iloc[:, 1]  # Using iloc to select the second column (index 1)
print("\nSecond Column (Age):")
print(second_column)

Head of the dataframe:
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
3    David   40      Houston   80000
4     Emma   22      Phoenix   55000

Tail of the dataframe:
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
3    David   40      Houston   80000
4     Emma   22      Phoenix   55000

Second Column (Age):
0    25
1    30
2    35
3    40
4    22
Name: Age, dtype: int64